Simulators/simulator/firmware/Arduino/hardware/simulators_attiny/avr/boards.txt
# Consolidated boards.txt for all Liverpool Ringing Simulator ATtiny boards
#
###########################################################################
# One Bell Simulator Interface Board
onebell.name=One Bell Simulator Interface Board (ICSP)
onebell.bootloader.tool=arduino:avrdude
onebell.bootloader.unlock_bits=0xff
onebell.bootloader.lock_bits=0xff
onebell.build.core=arduino:arduino
onebell.build.board=attiny
onebell.upload.tool=arduino:avrdude
onebell.upload.maximum_size=8192
onebell.build.mcu=attiny85
onebell.build.variant=tiny8
onebell.bootloader.low_fuses=0xe2
onebell.bootloader.high_fuses=0xd5
onebell.bootloader.extended_fuses=0xff
onebell.build.f_cpu=8000000L
onebell.build.board=AVR_ONEBELL

###########################################################################
# 38kHz Simulator Sensor Interface Boards
sensor38khz.name=38kHz Simulator Sensor Interface Boards (ICSP)
sensor38khz.bootloader.tool=arduino:avrdude
sensor38khz.bootloader.unlock_bits=0xff
sensor38khz.bootloader.lock_bits=0xff
sensor38khz.build.core=arduino:arduino
sensor38khz.build.board=attiny
sensor38khz.upload.tool=arduino:avrdude
sensor38khz.upload.maximum_size=8192
sensor38khz.build.mcu=attiny85
sensor38khz.build.variant=tiny8
sensor38khz.bootloader.low_fuses=0xe2
sensor38khz.bootloader.high_fuses=0xd5
sensor38khz.bootloader.extended_fuses=0xff
sensor38khz.build.f_cpu=8000000L
sensor38khz.build.board=AVR_38KHZSENSOR

###########################################################################
# Twin Simulator Sensor Interface Board (ATtiny, no serial port)
twinsensor.name=Twin Sensor Interface Board (ATtiny) (ICSP)
twinsensor.bootloader.tool=arduino:avrdude
twinsensor.bootloader.unlock_bits=0xff
twinsensor.bootloader.lock_bits=0xff
twinsensor.build.core=arduino:arduino
twinsensor.build.board=attiny
twinsensor.upload.tool=arduino:avrdude
twinsensor.upload.maximum_size=8192
twinsensor.build.mcu=attiny85
twinsensor.build.variant=tiny8
twinsensor.bootloader.low_fuses=0xe2
twinsensor.bootloader.high_fuses=0xd5
twinsensor.bootloader.extended_fuses=0xff
twinsensor.build.f_cpu=8000000L
twinsensor.build.board=AVR_TWINSENSOR_TINY
